Autodesk.Revit.DB.Structure.RebarHandlePositionData.SetPosition(System.Int32,Autodesk.Revit.DB.XYZ)
Sets the position for a specified handle. This information is set to the rebar after the API execution is finished successfully.
handleTag:
The tag of the handle.
position:
Position of the handle.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input point lies outside of Revit design limits.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018